<a href="https://colab.research.google.com/github/lucguittard/DS-Unit-1-Sprint-2-Data-Wrangling-and-Storytelling/blob/master/Luc_Guittard_LS_DS_121_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

_Lambda School Data Science_

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [12]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-08-13 04:38:07--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.128.109
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.128.109|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.1’

instacart_online_gr 100%[===================>] 196.03M  82.9MB/s    in 2.4s

2019-08-13 04:38:10 (82.9 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.1’ saved [205548478/205548478]

In [11]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [13]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [14]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [7]:
##### YOUR CODE HERE #####
from IPython.display import display, Image
url = 'https://cdn-images-1.medium.com/max/1600/1*vYGFQCafJtGBBX5mbl0xyw.png'
example = Image(url=url, width=600)

display(example)

In [0]:
#columns of interest: product name and ID#, ...

In [9]:
import pandas as pd
orders = pd.read_csv('orders.csv')
orders.head()

#order id for unique orders -> want also to know corresponding items ordered

FileNotFoundError: ignored

In [10]:
order_products__prior = pd.read_csv('order_products__prior.csv')
print(order_products__prior.shape)
order_products__prior.head()
#add_to_card_order -> for calculation of number of times each product is being ordered

(32434489, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [11]:
#interested in first three columns from order_products__prior.csv
df1 = order_products__prior.drop('reordered',axis = 1)
print(df1.shape) #ok, just checking drop function
df1.head()

(32434489, 3)

   order_id  product_id  add_to_cart_order
0         2       33120                  1
1         2       28985                  2
2         2        9327                  3
3         2       45918                  4
4         2       30035                  5

In [12]:
import pandas as pd
products = pd.read_csv('products.csv')
products.head()

#merging -> need common reference column or table - that is, order_products__prior (for order and product IDs)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [13]:
#interested in product name and ID# from products.csv; and that's it... proceed to merge step (6 columns drawn from two .csv files)
df2 = products.drop(['aisle_id','department_id'],axis=1)
print(df2.shape)
df2.head()

(49688, 2)

   product_id                                       product_name
0           1                         Chocolate Sandwich Cookies
1           2                                   All-Seasons Salt
2           3               Robust Golden Unsweetened Oolong Tea
3           4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4           5                          Green Chile Anytime Sauce

In [0]:
# aisles = pd.read_csv('aisles.csv')
# aisles.head()

In [0]:
# departments = pd.read_csv('departments.csv')
# departments.head()

In [16]:
#merging with the common column being 'product_id'

df3 = pd.merge(df1,df2)
print(df3.shape)
df3.head()

#...nooice, all the rows are there

(32434489, 4)

   order_id  product_id  add_to_cart_order        product_name
0         2       33120                  1  Organic Egg Whites
1        26       33120                  5  Organic Egg Whites
2       120       33120                 13  Organic Egg Whites
3       327       33120                  5  Organic Egg Whites
4       390       33120                 28  Organic Egg Whites

In [17]:
#time to institute a counting regime; want to know the number of orders for each product, specfically the top 10 ->refer to code from previous lesson
df3['product_name'].value_counts()  #no parameter to specify top 10 -> check groupby fxn->see today's subject matter
#I guess add_to_cart_order had served no purpose -> may drop to clean

Banana                                           472565
Bag of Organic Bananas                           379450
Organic Strawberries                             264683
Organic Baby Spinach                             241921
Organic Hass Avocado                             213584
Organic Avocado                                  176815
Large Lemon                                      152657
Strawberries                                     142951
Limes                                            140627
Organic Whole Milk                               137905
Organic Raspberries                              137057
Organic Yellow Onion                             113426
Organic Garlic                                   109778
Organic Zucchini                                 104823
Organic Blueberries                              100060
Cucumber Kirby                                    97315
Organic Fuji Apple                                89632
Organic Lemon                                     87746
Apple Honeycrisp Organic                          85020
Organic Grape Tomatoes                            84255
Seedless Red Grapes                               82689
Organic Cucumber                                  80392
Honeycrisp Apple                                  79769
Organic Baby Carrots                              76896
Organic Half & Half                               76360
Sparkling Water Grapefruit                        75886
Organic Large Extra Fancy Fuji Apple              75165
Yellow Onions                                     73167
Organic Gala Apples                               72846
Organic Baby Arugula                              72829
                                                  ...
11.3 Oz. Oreo Fudge Creme Double Chocolate            1
Coconut Bliss Pineapple Coconut                       1
Frittata, Farmer's Market                             1
Control GX Gray Reducing Shampoo                      1
Organic Lowfat Strawberry Yogurt Kefir                1
Chewy Chocolate Chip                                  1
Glycerine Soap Cucumber                               1
Multigrain Penne Rigate                               1
Max White With Polishing Star Soft Toothbrush         1
Salsa, Black Bean                                     1
Citronge Extra Fine Orange Liqueur                    1
Deep Clean Cleanser & Mask                            1
Pure Peppermint Extract                               1
Thick 'n Chunky Salsa Mild                            1
Orange Recharge                                       1
Tangerine Melon Bubble Bath                           1
'Swingtop' Premium Lager                              1
Hot Oatmeal Multigrain Raisin                         1
Sloppy Joe Sandwich Makers                            1
Tropic Thunder  Coconut & Cream                       1
Blueberry Blast Fruit and Chia Seed Bar               1
Coconut Cardamom Almond Butter                        1
Natural Peanut Butter With Flaxseed                   1
Indian Wells Merlot                                   1
Miss Treated Conditioner                              1
Peachtree Schnapps                                    1
Orangemint Flavored Water                             1
Hennepin Farmhouse Ale                                1
Greek Blended Cherry Fat Free Yogurt                  1
Easter Basket                                         1
Name: product_name, Length: 49677, dtype: int64

In [18]:
df4 = df3['product_name'].value_counts()
df4.head(10)

Banana                    472565
Bag of Organic Bananas    379450
Organic Strawberries      264683
Organic Baby Spinach      241921
Organic Hass Avocado      213584
Organic Avocado           176815
Large Lemon               152657
Strawberries              142951
Limes                     140627
Organic Whole Milk        137905
Name: product_name, dtype: int64

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [19]:
import numpy as np
table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

print(table1)

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [20]:
table2 = table1.T
print(table2)

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [21]:
#Table2 -> Tidy 
table3 = table2.reset_index()
#print(table3)
table4 = table3.melt( id_vars = ['index'], value_vars = ['John Smith', 'Jane Doe', 'Mary Johnson'])

table4

tidy = table4.rename(columns={
    'index': 'Treatment', 
    'variable': 'Name', 
    'value': 'Result'
})

tidy

    Treatment          Name  Result
0  treatmenta    John Smith     NaN
1  treatmentb    John Smith     2.0
2  treatmenta      Jane Doe    16.0
3  treatmentb      Jane Doe    11.0
4  treatmenta  Mary Johnson     3.0
5  treatmentb  Mary Johnson     1.0

In [22]:
#Tidy -> Table 2
tidy.pivot_table(index='Name', columns='Treatment', values='Result')

Treatment     treatmenta  treatmentb
Name
Jane Doe            16.0        11.0
John Smith           NaN         2.0
Mary Johnson         3.0         1.0

In [23]:
import seaborn as sns
flights = sns.load_dataset('flights')
flights.head()
#"Create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. 
# (You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.")

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [26]:
##### YOUR CODE HERE #####
flights.pivot_table(index='year',columns = 'month') 

#...checks out. Now some time for the stretch goals

      passengers                       ...
month    January February March April  ... September October November December
year                                   ...
1949         112      118   132   129  ...       136     119      104      118
1950         115      126   141   135  ...       158     133      114      140
1951         145      150   178   163  ...       184     162      146      166
1952         171      180   193   181  ...       209     191      172      194
1953         196      196   236   235  ...       237     211      180      201
1954         204      188   235   227  ...       259     229      203      229
1955         242      233   267   269  ...       312     274      237      278
1956         284      277   317   313  ...       355     306      271      306
1957         315      301   356   348  ...       404     347      305      336
1958         340      318   362   348  ...       404     359      310      337
1959         360      342   406   396  ...       463     407      362      405
1960         417      391   419   461  ...       508     461      390      432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [20]:
##### YOUR CODE HERE #####

import pandas as pd
orders = pd.read_csv('orders.csv')
df1 = orders.drop(['eval_set','order_dow','days_since_prior_order','order_number'],axis=1)
df1.head()

   order_id  user_id  order_hour_of_day
0   2539329        1                  8
1   2398795        1                  7
2    473747        1                 12
3   2254736        1                  7
4    431534        1                 15

In [16]:
products = pd.read_csv('products.csv')
df2 = products.drop(['aisle_id','department_id'],axis=1)
df2.head()

   product_id                                       product_name
0           1                         Chocolate Sandwich Cookies
1           2                                   All-Seasons Salt
2           3               Robust Golden Unsweetened Oolong Tea
3           4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4           5                          Green Chile Anytime Sauce

In [17]:
order_products__prior = pd.read_csv('order_products__prior.csv')
df3 = order_products__prior.drop('reordered', axis=1)
df3.head()

   order_id  product_id  add_to_cart_order
0         2       33120                  1
1         2       28985                  2
2         2        9327                  3
3         2       45918                  4
4         2       30035                  5

In [18]:
products_prior = pd.merge(df2,df3)
products_prior.head()

   product_id                product_name  order_id  add_to_cart_order
0           1  Chocolate Sandwich Cookies      1107                  7
1           1  Chocolate Sandwich Cookies      5319                  3
2           1  Chocolate Sandwich Cookies      7540                  4
3           1  Chocolate Sandwich Cookies      9228                  2
4           1  Chocolate Sandwich Cookies      9273                 30

In [21]:
products_prior_hour = pd.merge(products_prior,df1)
products_prior_hour.head()

   product_id                product_name  ...  user_id  order_hour_of_day
0           1  Chocolate Sandwich Cookies  ...    38259                 11
1         769      Sliced American Cheese  ...    38259                 11
2        6184                 Clementines  ...    38259                 11
3        8048     Packaged Grape Tomatoes  ...    38259                 11
4        9007              Frosted Flakes  ...    38259                 11

[5 rows x 6 columns]

In [0]:
products_prior_hour.shape
df4 = products_prior_hour

In [0]:
products_prior_hour['product_name'].value_counts()

#sum number of occurences of each product_name, append values as new column | unique and value_counts functions may be useful
#delete all rows/entries less than 2900 
#order descending based on 'order_hour_of_day'
#done after eying the top 25 products and verifying

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####